Revit 2027 API
Element.GetParameter Method
Retrieves a parameter from the element given identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Parameter GetParameter(
	ForgeTypeId parameterTypeId
)
Public Function GetParameter (
	parameterTypeId As ForgeTypeId
) As Parameter
public:
Parameter^ GetParameter(
	ForgeTypeId^ parameterTypeId
)
member GetParameter :
        parameterTypeId : ForgeTypeId -> Parameter
Parameters
parameterTypeId ForgeTypeId
Identifier of the built-in parameter.
Return Value
Parameter
Exceptions
Exception | Condition
ArgumentException |  parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
ArgumentNullException |  A non-optional argument was NULL
Remarks
Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. This method uses a built in parameter identifier to access the parameter. Autodesk Revit has a large number of built in parameters that are available via static properties.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace